Turbulent vs Laminar/25psi10torrturbulent/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 288);            //uniform (0 0 852);
    }

    outlet
    {
        type            zeroGradient;
    }

    obstacle
    {
        type            maxwellSlipU;
        accommodationCoeff 1;
        Uwall           uniform (0 0 0);
        thermalCreep    on;
        curvature       on;
    }

}

// ************************************************************************* //
